package 内部类;
/*
非静态内部类
非静态内部类(外部类里使用非静态内部类和平时使用其他类没什么不同)
1.非静态内部类对象必须寄存在一个外部类对象里。
因此，如果有一个非静态内部类对象那么一定存在对应的外部类对象。非静态内部类对象单独属于外部类的某个对象。
2.非静态内部类可以直接访问外部类的成员，但是外部类不能直接访问非静态内部类成员。
3.非静态内部类不能有静态方法、静态属性和静态初始化块。
4.成员变量访问要点:
1.内部类里方法的局部变量:变量名。
2. 内部类属性:this.变量名。
3. 外部类属性:外部类名.this.变量名,
*/
public class 非静态内部类 {
	public static void main(String[] args) {
		外部类1.内部类1 nw1 = new 外部类1().new 内部类1();
		nw1.n1();
	}
}
class 外部类1{
	 String n1 ="外部类";
	class 内部类1{
		void n1() {
			String n1 ="内部类";
		System.out.println(n1+"调用"+外部类1.this.n1);
		}	
	}
}	