package IO;
/*
 1.1File 类的作用
File 类是 Java 提供的针对磁盘中的文件或目录转换对象的包装类。
一个 File 对象而可以代表一个文件或目录，File 对象可以实现获取文件和目录属性等功能
可以实现对文件和目录的创建，删除等功能。

------------------------------------------------------------------------------------------

File 类操作目录与文件的常用方法
针对文件操作的方法
createNewFile()  //创建新文件。
delete()  //直接从磁盘上删除
exists()  //查询磁盘中的文件是否存在
getAbsolutePath()  //获取绝对路径
getPath()   //获取相对路径
getName()   //获取文件名 相当于调用了一个 toString 方法。
isFile()		//判断是否是文件
length()		//查看文件中的字节数
isHidden()	//测试文件是否被这个抽象路径名是一个隐藏文件。

针对目录操作的方法
exists()			//查询目录是否存在
isDirectory()		//判断当前路径是否为目录
mkdir()		//创建目录
getParentFile()		//获取当前目录的父级目录。
list()		//返回一个字符串数组，包含目录中的文件和目录的路径名,
listFiles()		//返回一个 File 数组，表示用此抽象路径名表示的目录中的文件,
 */
public class File类_File类简介 {

}
